package com.example.finaluritesting

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.Button
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.finaluritesting.dataclasses.Image

class Testing : AppCompatActivity() {

    private lateinit var button: Button


    companion object {
        val INTENT_PARCELABLE = "OBJECT_INTENT"
    }

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.testing)
        button = findViewById(R.id.button13)

        goToMenu()

        val imageList = listOf<Image>(
            Image(
                R.drawable._475119_orig_5a79cd1e9f24c,
                "შერლოკი",
                "        გამოშვების წელი: 2010\n" +
                        "        ქვეყანა: დიდი ბრიტანეთი\n" +
                        "        ჟანრი: დრამა, მისტიკა, დეტექტივი, სერიალი\n" +
                        "        რეჟისორი: პოლ მაკგიგანი, Nick Hurran, კოკი გიდროიკი\n" +
                        "        აღწერა\n" +
                        "ოთხმა იდუმალმა თვითმკვლელობამ ლონდონის პოლიციას საქმე გაურთულა. ინსპექტორი დახმარებას სთხოვს დეტექტივ-კონსულტანტს შერლოკ ჰოლმსს. მის პარტნიორ დოქტორ ვატსონთან ერთად ჰოლმსი ათვალიერებს მიტოვებულ სახლს - ბოლო დანაშაულის ადგილს სადაც ნაპოვნია გარდაცვლილი ვარდისფერებში ჩაცმული ქალი. სიკვდილის წინ ქალს სურდა დაეწერა რაღაც სიტყვა. დედუქციის მეთოდის გამოყენებით, ჰოლმსი მიდის დასკვნამდე რომ ოთხივე მკვლელობა ეკუთვნის სერიულ მკვლელს."
            ),
            Image(
                R.drawable._4a5a8d0_1406_4178_97a5_2649504faa85,
                "აკირა",
                "        გამოშვების წელი: 1988\n" +
                        "        ქვეყანა: იაპონია\n" +
                        "        ჟანრი: ფანტასტიკა, ანიმაციური\n" +
                        "        ხანგრძლივობა: 2 საათი 4 წუთი\n" +
                        "        რეჟისორი: ოტომო კაცუჰირო\n" +
                        "        აღწერა\n" +
                        "1988 წელი, აფეთქება ტოკიოს მიწასთან გაასწორებს. მის ადგილას 2019 წელს ახალი ტოტალიტარული სახელმწიფო აღმოცენდა. კვლევით ცენტრებში ადამიანებზე პარაფსიქოლოგიური ცდები ტარდება სრულყოფილი იარაღის შესაქმნელად. ამასობაში ქვეყანაში რელიგიური კულტი ჩნდება. ეს არის ზეადამიანი სახელად აკირა, რომლის მოსვლაც იაპონიის ყველა პრობლემას გადაჭრის. სიუჟეტის ცენტრშია მოზარდი ბაიკერების ჯგუფი კანედას მეთაურობით.\n"
            ),
            Image(
                R.drawable.download,
                "აბა, დამაცადე!",
                "        გამოშვების წელი: 1969\n" +
                        "        ქვეყანა: საბჭოთა კავშირი\n" +
                        "        ჟანრი:მძაფრ-სიუჟეტიანი, კომედია, საოჯახო, ანიმაციური, სერიალი\n" +
                        "        რეჟისორი:Vyacheslav Kotyonochkin, Yuriy Butyrin, Vladimir Tarasov\n" +
                        "        აღწერა\n" +
                        "მგლის და კურდღლის სახალისო ამბები."
            ),
            Image(
                R.drawable.download__1_,
                "პატარა კაცი",
                "        გამოშვების წელი: 2006\n" +
                        "        ქვეყანა: აშშ, კანადა\n" +
                        "        ჟანრი: კომედია, დეტექტივი\n" +
                        "        ხანგრძლივობა:1 საათი 38 წუთი\n" +
                        "        რეჟისორი:კინენ აივორი უაიანსი\n" +
                        "        აღწერა\n" +
                        "ფილმის მთავარი გმირი ისე ოცნებობს მამობაზე, რომ პოლიციისგან გაქცეულ კრიმინალს იშვილებს.\n"
            ),
            Image(
                R.drawable.hqdefault,
                "შემოქმედი",
                "        გამოშვების წელი: 2018\n" +
                        "        ქვეყანა: საქართველო\n" +
                        "        ჟანრი: დრამა\n" +
                        "        რეჟისორი: Ermalo Magradze\n" +
                        "        აღწერა\n" +
                        "\"შემოქმედი\" - ასე ეწოდება ერმალო მაღრაძის ტრილოგიის მესამე ნაწილს. ფილმი ადამიანთა მანკიერ მხარეებს გვიჩვენებს და ღმერთთან დაახლოებისკენ მოგვიწოდებს. ადამიანებმა დაკარგეს ღმერთი - სწორედ ამიტომ, მთავარი პერსონაჟი კეთილი საქმეებით ცდილობს კაცობრიობის ამ უდიდესი ცოდვის გამოსყიდვას, მაგრამ მას გზად უბედურებათა დიდი ლაბირინთი ელის..."
            ),
            Image(
                R.drawable.spider_man_no_way_home_1636451315678_1636451323010,
                "ადამიანი ობობა: სახლიდან შორს",
                "        ჟანრი: მძაფრ-სიუჟეტიანი, სათავგადასავლო, ფანტასტიკა\n" +
                        "        სტუდია: Marvel Studios, Columbia Pictures, Pascal Pictures\n" +
                        "        გამოშვების წელი: 2019\n" +
                        "        რეჟისორი: Jon Watts\n" +
                        "        ფილმის სიუჟეტი:\n" +
                        "პიტერ პარკერი და მისი მეგობრები საზაფხულო მოგზაურობისთვის მიდიან ევროპაში. თუმცა, ისინი ვერ შეძლებენ დასვენებას - პიტერი უნდა დათანხმდეს ნიკ ფიურის დახმარებას მისტიური არსებების ძიებაში, რომლებიც იწვევენ ბუნებრივ კატასტროფებს და ემუქრებიან კონტინენტს..."
            ),
            Image(
                R.drawable.tbbt_t,
                "დიდი აფეთქების თეორია",
                "        გამოშვების წელი: 2007\n" +
                        "        ქვეყანა: აშშ\n" +
                        "        ჟანრი: კომედია, სერიალი\n" +
                        "        რეჟისორი: Mark Cendrowski, Anthony Rich, Peter Chakos\n" +
                        "        აღწერა\n" +
                        "ლეონარდ ჰოფსტადტერი და შელდონ კუპერი ბრწყინვალე ფიზიკოსები არიან. თუმცა, გენიალური ნიჭი მათ ადამიანებთან ურთიერთობაში ვერ ეხმარება, განსაკუთრებით კი ქალებთან აქვთ პრობლემა. ყველაფერი იცვლება მას შემდეგ, რაც მათ მოპირდაპირე მხარეს ლამაზმანი პენი სახლდება."
            ),
            Image(
                R.drawable.vanisreitingi_5c99eca001b76,
                "ცხოვრება ლუისთან",
                "        გამოშვების წელი: 1995\n" +
                        "        ქვეყანა: აშშ\n" +
                        "        ჟანრი: კომედია, საოჯახო, ანიმაციური, სერიალი\n" +
                        "        რეჟისორი: Matthew O'Callaghan, ბერტ რინგი\n" +
                        "        აღწერა\n" +
                        "ლუი ცხოვრობს სახლში თავის მშობლებთან, ბაბუასთან და და–ძმებთან ერთად. ანიმაციის ყველა ეპიზოდში მოთხრობილია ლუის სახალისო თავგადასავლებზე."
            ),
            Image(
                R.drawable.venom_2_new_movie_poster_confirms_release_date,
                "ვენომი",
                "        გამოშვების წელი: 2018\n" +
                        "        ქვეყანა: აშშ\n" +
                        "        ჟანრი: მძაფრ-სიუჟეტიანი, ფანტასტიკა, სათავგადასავლო\n" +
                        "        ხანგრძლივობა: 1 საათი 52 წუთი\n" +
                        "        რეჟისორი: რუბენ ფლიაიშერი" +
                        "        აღწერა\n" +
                        "დედამიწაზე პარაზიტული არსება გამოჩდება – უცხოპლანეტური ანომალია, ამ ნივთიერებას პლანეტაზე მთელი სიცოცხლის შეცვლა შეუძლია, ადამიანის სხეულში მოხვედრის შემდეგ, მას უკიდურესად სასტიკად გარდაქმნის, განსაკუთრებულ ძალას აძლევს, მაგრამ ამავე დროს მის ნებას ახშობს და ბნელი აზრებით შთააგონებს."
            ),
        )

        val recyclerView = findViewById<RecyclerView>(R.id._imageRecyclerView)
        recyclerView.layoutManager = LinearLayoutManager(this)
        recyclerView.setHasFixedSize(true)
        recyclerView.adapter = ImageAdapter(this, imageList) {
            val intent = Intent(this, DetailActivity::class.java)
            intent.putExtra(INTENT_PARCELABLE, it)
            startActivity(intent)
        }
    }

    private fun goToMenu() {
        button.setOnClickListener() {
            val intent = Intent(this, Menu::class.java)
            startActivity(intent)
            finish()
        }
    }
}